#Реаліазувати Калькулятор Індексу маси тіла
'''
Користувач вводить зріст
Користувач вводить вагу
Підрузувати за формулою індекс маси тіла
В залежності від значення
вивести сповіщення що до стану людини
'''
h = float(input("Введіть зріст в сантиметрах:"))/100
w = float(input("Введіть вагу в кілограмах:"))
choice = w / (h * h)
if choice <= 18.5:
    print("У вас недостатня вага")
if choice > 18.5 and choice < 25:
    print("У вас нормальна вага")
if choice > 25.0 and choice < 30:
    print("У вас зайва вага")
if choice >= 30:
    print("У вас ожиріння")
