# 1 На знаходження елементів
'''
Знайти індекси елементу 155 у

data = [[1,2,3],[4,5,6],[6,7,8,[155]]]
data2 = {'1':'1','2':'2','3':'3','4':[{'5':'5','6':[155]}]}
data3 = [{1:2,2:3,3:[4,5,6,7,{8:9,10:[3,2,1,[155]]}]}]
# Ускладнена
data4 = {"1":"1","2":[1,2,3,4,5,6,7,8,9,10,[3,2,4,1,2,3,4],[3,2,4,3,5,4,{"1":1,"2":2,"3":{"result":[1,2,3,4,155]}},6,5,7,6,9],[1,3,2,4,3,5,4,6,5]]}
'''
data = [
    [1, 2, 3],
    [4, 5, 6],
    [6, 7, 8, [155]]
]
print(data[2][3][0])

data2 = {'1': '1',
         '2': '2',
         '3': '3',
         '4': [{'5': '5', '6': [155]}]
         }
print(data2['4'][0]['6'][0])

data3 = [
    {1: 2, 2: 3,
     3: [4, 5, 6, 7,
         {8: 9, 10: [3, 2, 1, [155]]}]}
]
print(data3[0][3][4][10][3][0])

data4 = {
    "1": "1",
    "2": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, [3, 2, 4, 1, 2, 3, 4], [3, 2, 4, 3, 5, 4, {"1": 1, "2": 2,
                                                                                    "3": {"result": [1, 2, 3, 4, 155]}},
                                                                 6, 5, 7, 6, 9], [1, 3, 2, 4, 3, 5, 4, 6, 5]]
}
print(data4["2"][11][6]["3"]["result"][4])

# 2 Реалізувати структури (через словники)
'''
1 Товар
ключі:назва,опис,ціна 
2 Стаття
ключі: заголовок,текст,опис
3 Праціівник
ключі: ім'я,посада,офіс
де Офіс це словник
із ключами: місто,номер, тип (віддалений або офіційний)
'''
tovar = {"name": "Назва товару",
         "description": "Опис товару",
         "price": "Ціна товару",
         "store": {"name": "Магазин №1",
                   "description": "Товар №1",
                   "price": 100}}
print(tovar["store"]["price"])

article = {"title": "Заголовок",
           "text": "Текст",
           "description": "Опис",
           "store": {"title": "Заголовок №1",
                     "text": "Текст №1",
                     "description": "Опис №1"}}
print(article["store"]["description"])

worker = {'name': 'Імя', 'position': 'Посада', 'Office': {'city': 'Місто', 'number': 100, 'type': 'віддалений' or 'офіційний'
                                                          }
          }
print(worker['Office']['type'])